app/Controllers/Book.php

SELECT `book`.`id` as `id`, `book`.`title`, `book`.`author`, `book`.`publication_year`, `publisher`.`name`, `category`.`category`, `book`.`quantity`
FROM `book`
LEFT JOIN `publisher` ON `book`.`id_publisher`=`publisher`.`id`
LEFT JOIN `category` ON `book`.`id_category`=`category`.`id`
WHERE `book`.`deleted_at` IS NULL
---
    public function index()
    {
        if (!session('id')) {
            return redirect()->to(base_url())->with('error', 'Anda harus login');
        }
        $data = array(
            'book' => $this->bookModel
                ->select('book.id as id,book.title,book.author,book.publication_year,publisher.name,category.category,book.quantity')
                ->join('publisher', 'book.id_publisher=publisher.id', 'left')
                ->join('category', 'book.id_category=category.id', 'left')
                ->findAll()
        );

SELECT *
FROM `publisher`
WHERE `publisher`.`deleted_at` IS NULL
SELECT *
FROM `category`
WHERE `category`.`deleted_at` IS NULL
---
    public function add()
    {
        if (!session('id')) {
            return redirect()->to(base_url())->with('error', 'Anda harus login');
        }

        $data = array(
            'publisher' => $this->publisherModel->findAll(),
            'category' => $this->categoryModel->findAll(),
        );

UPDATE `book` SET `deleted_at` = '2023-05-16 12:36:07', `updated_at` = '2023-05-16 12:36:07'
WHERE `id` IN ('2')
AND `deleted_at` IS NULL
---
    public function delete($id)
    {
        if (!session('id')) {
            return redirect()->to(base_url())->with('error', 'Anda Harus Login');
        }

        $delete = $this->bookModel->delete($id);