app/Controllers/Borrow.php

SELECT `borrow`.`id` as `id`, `borrower`.`name`, `book`.`title`, `staff`.`name` as `staff`, `borrow`.`release_date`, `borrow`.`due_date`, `borrow`.`note`
FROM `borrow`
LEFT JOIN `borrower` ON `borrow`.`id_borrower`=`borrower`.`id`
LEFT JOIN `book` ON `borrow`.`id_book`=`book`.`id`
LEFT JOIN `staff` ON `borrow`.`id_staff`=`staff`.`id`
WHERE `borrow`.`deleted_at` IS NULL
---
    public function index()
    {
        if (!session('id')) {
            return redirect()->to(base_url())->with('error', 'Anda harus login');
        }
        $data = array(
            'borrow' => $this->borrowModel
                ->select('borrow.id as id,borrower.name,book.title,staff.name as staff,borrow.release_date,borrow.due_date,borrow.note')
                ->join('borrower', 'borrow.id_borrower=borrower.id', 'left')
                ->join('book', 'borrow.id_book=book.id', 'left')
                ->join('staff', 'borrow.id_staff=staff.id', 'left')
                ->findAll()
        );

UPDATE `borrow` SET `note` = 'Selesai pinjam', `updated_at` = '2023-05-19 11:22:20'
WHERE `borrow`.`id` IN ('1')
---
    public function returnbook($id)
    {
        if (!session('id')) {
            return redirect()->to(base_url())->with('error', 'Anda Harus Login');
        }
        $this->borrowModel->save([
            'id' => $id,
            'note' => "Selesai pinjam",
        ]);