app/Controllers/Category.php

    public function index()
    {
        if (!session('id')) {
            return redirect()->to(base_url())->with('error', 'Anda harus login');
        }
        $data = array(
            'category' => $this->CategoryModel->findAll(),
        );
---
SELECT *
FROM `category`
WHERE `category`.`deleted_at` IS NULL

    public function addpro()
    {
        if (!session('id')) {
            return redirect()->to(base_url())->with('error', 'Anda Harus Login');
        }

        $post = $this->request->getPost();

        if (!$this->validate([
            'category' => [
                'rules' => 'required',
                'errors' => ['required' => 'wajib diisi',],
            ],
        ])) {
            $validation = \config\Services::validation();
            session()->setFlashdata('validation', $validation->getErrors());
            return redirect()->to('Category-add')->withInput();
        }

        $this->CategoryModel->save([
            'category' => $post['category'],
        ]);
---
INSERT INTO `category` (`category`, `created_at`, `updated_at`) VALUES ('Novel', '2023-05-17 11:27:31', '2023-05-17 11:27:31')