app/Controllers/Staff.php

SELECT *
FROM `staff`
WHERE `staff`.`deleted_at` IS NULL
---
    public function index()
    {
        if (!session('id')) {
            return redirect()->to(base_url())->with('error', 'Anda harus login');
        }
        $data = array(
            'staff' => $this->staffModel->findAll(),
        );

SELECT *
FROM `staff`
WHERE `id` = '3'
AND `staff`.`deleted_at` IS NULL
 LIMIT 1
---
    public function edit($id)
    {
        if (!session('id')) {
            return redirect()->to(base_url())->with('error', 'Anda harus login');
        }

        $data = array(
            'item'  => $this->staffModel->where(['id' => $id])->first(),
            'id'    => $id,
        );